"REQUIREMENT_FAILED_MESSAGE_INSTALLATION_CHECK_2" = "System Integrity Protection (SIP) Check - Enabled";

"REQUIREMENT_FAILED_MESSAGE_INSTALLATION_CHECK_5" = "XCode-Select Error";

"REQUIREMENT_FAILED_MESSAGE_INSTALLATION_CHECK_1" = "Processor Error";

"REQUIREMENT_FAILED_MESSAGE_INSTALLATION_CHECK_4" = "Supported Mac";

"REQUIREMENT_FAILED_MESSAGE_VOLUME_CHECK_3" = "Imcompatible version of macOS. Please update to macOS 10.12.4 or later.";

"REQUIREMENT_FAILED_DESCRIPTION_INSTALLATION_CHECK_4" = "Your Mac already supports Night Shift. It is not Recommended to use this Patch.";

"REQUIREMENT_FAILED_DESCRIPTION_INSTALLATION_CHECK_2" = "SIP is enabled on this system. Please boot into Recovery HD or a Sierra Installer USB drive, open a new Terminal Window, and enter 'csrutil disable'. When completed, reboot back into your standard Sierra install, and run this Installer again.";

"REQUIREMENT_FAILED_DESCRIPTION_INSTALLATION_CHECK_1" = "This Mac doesn't Meet the minimum Requirements";

"REQUIREMENT_FAILED_DESCRIPTION_INSTALLATION_CHECK_5" = "Your Mac doesn't appear to have Command Line Tool. Please type 'xcode-select --install' command in the terminal to install it, then run this script again.";

"DISTRIBUTION_TITLE" = "macOS Night Shift Enabler";

